---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.RailConnectionOption.Weld
enum: Autodesk.Revit.DB.Architecture.RailConnectionOption
source: html/8cbeb5fd-2eab-c387-b499-869cedb44a19.htm
---
# Autodesk.Revit.DB.Architecture.RailConnectionOption.Weld

Rails will be joined in a manner as close to a miter as possible.